IDENTIFICATION DIVISION.
PROGRAM-ID. UPGRADE-ARMOR.

DATA DIVISION.

LINKAGE SECTION.
01 LK-INGOT-STOCK PIC 9(5).
01 LK-ARMOR-LV PIC 9.
01 LK-PLAYER-DEF PIC 9(3).

PROCEDURE DIVISION USING LK-INGOT-STOCK LK-ARMOR-LV LK-PLAYER-DEF.

  IF LK-INGOT-STOCK >= 2
    SUBTRACT 2 FROM LK-INGOT-STOCK
    ADD 1 TO LK-ARMOR-LV
    ADD 3 TO LK-PLAYER-DEF
    DISPLAY "インゴットを2つ使用し、防具を強化しました！"
  ELSE
    DISPLAY "インゴットが不足しています"
  END-IF

  GOBACK.
