IDENTIFICATION DIVISION.
PROGRAM-ID. UPGRADE-WEAPON.

DATA DIVISION.

LINKAGE SECTION.
01 LK-INGOT-STOCK PIC 9(5).
01 LK-WEAPON-LV PIC 9.
01 LK-PLAYER-ATK PIC 9(3).

PROCEDURE DIVISION USING LK-INGOT-STOCK LK-WEAPON-LV LK-PLAYER-ATK.

  IF LK-INGOT-STOCK >= 2
    SUBTRACT 2 FROM LK-INGOT-STOCK
    ADD 1 TO LK-WEAPON-LV
    ADD 3 TO LK-PLAYER-ATK
    DISPLAY "インゴットを2つ使用し、武器を強化しました！"
  ELSE
    DISPLAY "インゴットが不足しています"
  END-IF

  GOBACK.
