IDENTIFICATION DIVISION.
PROGRAM-ID. ORE.

DATA DIVISION.

WORKING-STORAGE SECTION.
01 BUY-QTY        PIC 9(5).
01 BUY-QTY-STR    PIC X(5).
01 TOTAL-COST     PIC 9(8).

LINKAGE SECTION.
01 LK-MONEY     PIC 9(6).
01 LK-ORE-STOCK PIC 9(5).

PROCEDURE DIVISION USING LK-MONEY LK-ORE-STOCK.
  MOVE 0 TO BUY-QTY
  MOVE SPACES TO BUY-QTY-STR

  PERFORM UNTIL BUY-QTY > 0
    DISPLAY "いくつ購入しますか？(5G/個)"
    DISPLAY "所持金：" LK-MONEY "G"
    DISPLAY "所持鉱石：" LK-ORE-STOCK "個"
    DISPLAY "キャンセルする場合は0を入力してください"
    ACCEPT BUY-QTY-STR

    IF FUNCTION TRIM(BUY-QTY-STR) IS NOT NUMERIC
      DISPLAY "数字を入力してください"
      MOVE 0 TO BUY-QTY
    ELSE
      MOVE FUNCTION TRIM(BUY-QTY-STR) TO BUY-QTY

      IF BUY-QTY <= 0
        DISPLAY "キャンセルしました"
        EXIT PARAGRAPH
      END-IF

      IF BUY-QTY > 10000
        DISPLAY "一度に購入できるのは10,000個までです"
        MOVE 0 TO BUY-QTY
      END-IF
    END-IF
  END-PERFORM


  COMPUTE TOTAL-COST = BUY-QTY * 5
  
  IF LK-MONEY >= TOTAL-COST
    ADD BUY-QTY TO LK-ORE-STOCK
    SUBTRACT TOTAL-COST FROM LK-MONEY
    DISPLAY BUY-QTY "個の鉱石を購入しました！"
    DISPLAY "所持金：" LK-MONEY "G"
    DISPLAY "所持鉱石：" LK-ORE-STOCK "個"
  ELSE
    DISPLAY "お金が足りません"
  END-IF

  GOBACK.
