IDENTIFICATION DIVISION.
PROGRAM-ID. SAVEGAME.

ENVIRONMENT DIVISION.
INPUT-OUTPUT SECTION.
FILE-CONTROL.
  SELECT SAVE-FILE ASSIGN TO "save.dat"
  ORGANIZATION IS LINE SEQUENTIAL.

DATA DIVISION.

FILE SECTION.
FD SAVE-FILE.
01 SAVE-DATA.
  05 SAVE-MONEY    PIC 9(6).
  05 SAVE-ORE      PIC 9(5).
  05 SAVE-INGOT    PIC 9(5).
  05 SAVE-DAY      PIC 9(4).
  05 SAVE-PRICE    PIC 9(4).
  05 SAVE-WEAPON-LV  PIC 9.
  05 SAVE-ARMOR-LV   PIC 9.
  05 SAVE-PLAYER-ATK PIC S9(3).
  05 SAVE-PLAYER-DEF PIC S9(3).
  05 SAVE-PLAYER-ITEM.
    10 SAVE-ITEM-STOCK OCCURS 5 PIC 9(3).

LINKAGE SECTION.
01 LK-MONEY PIC 9(6).
01 LK-ORE   PIC 9(5).
01 LK-INGOT PIC 9(5).
01 LK-DAY   PIC 9(4).
01 LK-PRICE PIC 9(4).
01 LK-WEAPON-LV  PIC 9.
01 LK-ARMOR-LV   PIC 9.
01 LK-PLAYER-ATK PIC S9(3).
01 LK-PLAYER-DEF PIC S9(3).
01 LK-PLAYER-ITEM.
  05 LK-ITEM-STOCK OCCURS 5 PIC 9(3).

PROCEDURE DIVISION USING
  LK-MONEY
  LK-ORE
  LK-INGOT
  LK-DAY
  LK-PRICE
  LK-WEAPON-LV
  LK-ARMOR-LV
  LK-PLAYER-ATK
  LK-PLAYER-DEF
  LK-PLAYER-ITEM.

  MOVE LK-MONEY TO SAVE-MONEY
  MOVE LK-ORE TO SAVE-ORE
  MOVE LK-INGOT TO SAVE-INGOT
  MOVE LK-DAY TO SAVE-DAY
  MOVE LK-PRICE TO SAVE-PRICE
  MOVE LK-WEAPON-LV  TO SAVE-WEAPON-LV
  MOVE LK-ARMOR-LV   TO SAVE-ARMOR-LV
  MOVE LK-PLAYER-ATK TO SAVE-PLAYER-ATK
  MOVE LK-PLAYER-DEF TO SAVE-PLAYER-DEF

MOVE LK-PLAYER-ITEM TO SAVE-PLAYER-ITEM

  OPEN OUTPUT SAVE-FILE
  WRITE SAVE-DATA
  CLOSE SAVE-FILE

  DISPLAY "データを保存しました"

  GOBACK.
