IDENTIFICATION DIVISION.
PROGRAM-ID. ADVENTURE.

DATA DIVISION.

WORKING-STORAGE SECTION.
01 EVENT-TYPE PIC 9.
01 WK-RESULT     PIC 9.
01 COMMAND       PIC 9.
01 MONSTER.
  05 M-NAME  PIC X(20).
  05 M-HP    PIC S9(4).
  05 M-ATK   PIC S9(3).

LINKAGE SECTION.
01 LK-PLAYER-HP  PIC S9(4).
01 LK-PLAYER-ATK PIC S9(3).
01 LK-PLAYER-DEF PIC S9(3).
01 LK-MONEY      PIC 9(6).
01 LK-ORE-STOCK  PIC 9(5).
01 LK-ITEM.
  05 LK-ITEM-STOCK OCCURS 5 PIC 9(3).
01 LK-ACTION-FLG PIC 9.
COPY ITEMTABLE.

PROCEDURE DIVISION USING
  LK-PLAYER-HP
  LK-PLAYER-ATK
  LK-PLAYER-DEF
  LK-MONEY
  LK-ORE-STOCK
  LK-ITEM
  LK-ACTION-FLG
  LK-ITEM-TABLE.

  MOVE 0 TO LK-ACTION-FLG
  MOVE 9 TO COMMAND
  PERFORM UNTIL COMMAND = 0
    DISPLAY "どこへ行く？"
    DISPLAY "1：ダンジョン"
    DISPLAY "2：別の街(COMING SOON...)"
    DISPLAY "0：戻る"

    ACCEPT COMMAND

    EVALUATE COMMAND
      WHEN 1
        MOVE 1 TO LK-ACTION-FLG
        PERFORM GO-DUNGEON
        EXIT PERFORM
      WHEN 2
        MOVE 0 TO LK-ACTION-FLG
        DISPLAY "まだ行けないようだ..."
      WHEN 0
        MOVE 0 TO LK-ACTION-FLG
        EXIT PERFORM
      WHEN OTHER
        DISPLAY "無効なコマンドです"
      END-EVALUATE
  END-PERFORM
  
  GOBACK.

  GO-DUNGEON.
    MOVE 0 TO WK-RESULT
    DISPLAY "ダンジョンに入った"

    CALL "BATTLE"
      USING LK-PLAYER-HP
            LK-PLAYER-ATK
            LK-PLAYER-DEF
            LK-MONEY
            LK-ORE-STOCK
            LK-ITEM
            WK-RESULT
            MONSTER
            LK-ITEM-TABLE
    
    PERFORM RESULT-HANDLING.

  RESULT-HANDLING.
    EVALUATE WK-RESULT
      WHEN 1
        DISPLAY "勝利！"
      WHEN 2
        DISPLAY "負けた...所持金が0になった"
        MOVE 0 TO LK-MONEY
      WHEN 3
        DISPLAY "逃げ帰った"
      WHEN OTHER
        DISPLAY "無効な値を受け取りました"
    END-EVALUATE

    PERFORM RETURN-BASE.

  RETURN-BASE.
    DISPLAY "拠点に戻った"
    MOVE 100 TO LK-PLAYER-HP
    DISPLAY "ひと休みしてHPが回復した".
